# AutoPanelWall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AutoPanelWall Property
ParameterTypeId Class See Also
---
"Curtain Panel"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AutoPanelWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AutoPanelWall As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AutoPanelWall {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace